pmo-dataset/variations/graphviz_basic/01.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Send order confirmation to customer" -> "ExclusiveGateway_1";
  "ExclusiveGateway_3" -> "end";
  "ParallelGateway_2" -> "Address customer concerns or questions";
  "Record order in system" -> "Send order confirmation to customer";
  "Address customer concerns or questions" -> "ParallelGateway_1";
  "ParallelGateway_1" -> "ExclusiveGateway_4";
  "ExclusiveGateway_1" -> "ExclusiveGateway_3";
  "Collect customer information" -> "ParallelGateway_1";
  "start" -> "Receive customer inquiry";
  "ParallelGateway_2" -> "Collect customer information";
  "ExclusiveGateway_4" -> "ExclusiveGateway_3";
  "ExclusiveGateway_2" -> "ExclusiveGateway_1";
  "Place order" -> "Record order in system";
  "ExclusiveGateway_4" -> "Guide customer in selecting product/service";
  "Provide quote" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "Place order";
  "Receive customer inquiry" -> "ParallelGateway_2";
  "Guide customer in selecting product/service" -> "Provide quote";

  "start" [shape=circle, label="start"];
  "end" [shape=circle, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
}
