pmo-dataset/variations/mermaid_with_ids/01.mmd
graph LR
	classDef endEvent stroke-width:3px
	Task_1["Record order in\nsystem"]
	Task_2["Collect customer\ninformation"]
	Task_3["Guide customer in\nselecting\nproduct/service"]
	Task_4["Provide quote"]
	Task_5["Receive customer\ninquiry"]
	Task_6["Place order"]
	Task_7["Address customer\nconcerns or\nquestions"]
	Task_8["Send order\nconfirmation to\ncustomer"]
	StartNoneEvent_1(("start"))
	EndNoneEvent_1(("end")):::endEvent
	ExclusiveGateway_1{"X"}
	ExclusiveGateway_2{"X"}
	ExclusiveGateway_3{"X"}
	ExclusiveGateway_4{"X"}
	ParallelGateway_1{"+"}
	ParallelGateway_2{"+"}

	Task_8 --> ExclusiveGateway_1
	ExclusiveGateway_3 --> EndNoneEvent_1
	ParallelGateway_2 --> Task_7
	Task_1 --> Task_8
	Task_7 --> ParallelGateway_1
	ParallelGateway_1 --> ExclusiveGateway_4
	ExclusiveGateway_1 --> ExclusiveGateway_3
	Task_2 --> ParallelGateway_1
	StartNoneEvent_1 --> Task_5
	ParallelGateway_2 --> Task_2
	ExclusiveGateway_4 --> ExclusiveGateway_3
	ExclusiveGateway_2 --> ExclusiveGateway_1
	Task_6 --> Task_1
	ExclusiveGateway_4 --> Task_3
	Task_4 --> ExclusiveGateway_2
	ExclusiveGateway_2 --> Task_6
	Task_5 --> ParallelGateway_2
	Task_3 --> Task_4
